---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.SomeMembersNotRestored
source: html/0d7138cd-69ad-aaee-935b-385ad4fc5f1c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.SomeMembersNotRestored Property

Revit was not able to restore all of the requested group members. The members may depend on elements that are still excluded.

## Syntax (C#)
```csharp
public static FailureDefinitionId SomeMembersNotRestored { get; }
```